#+PROPERTY: header-args :results output

* Intro

#+title: Arrays

Yesterday we learned about the python interpreter and how it could handle numbers, text, and variables. We can add them together with the "+" symbol. We can set variables with the "=" sign. And lastly we learned we could combine the plus and the equals to modify a variable relative to its previous value.

* Lists

Python can handle lists. In fact, python can handle many kinds of lists. Today we will focus on what programmers call an "array". They can be created like this.

#+BEGIN_SRC python
  my_array = [ "pig", "cow", "chicken" ]
  print(my_array)
#+END_SRC

* Definition of "Index"

Could someone tell me where they have heard the word "index" before?

* Indexing

In the back of your textbooks you might have an index which gives you the page numbers of vocabulary words for example. This is kind of what we are referring to when we talk about an index of an array. But instead of the page number, the index refers to the position of a thing in a list starting at 0. So the first thing in the list has an index of 0, the second has 1, and the third has an index of 2.

* Indexing Example

In this example we are giving the index [1] to the list of items.

#+BEGIN_SRC python
  my_array = [ "pig", "cow", "chicken" ]
  print(my_array[1])
#+END_SRC

* Empty List

Lists can be created with no items.

#+BEGIN_SRC python
  empty_array = []
  print(empty_array)
#+END_SRC

* Adding to List

Once created, either empty or with items, lists can be added to using the "append" command used like this.

#+BEGIN_SRC python
  array = []
  array.append("cow")
  array.append("goat")
  print(array)
#+END_SRC

#+RESULTS:
: ['cow', 'goat']

* Removing from list

We can use the "remove" command to remove an item from the list.

#+BEGIN_SRC python
  my_array = [ "pig", "cow", "chicken" ]
  my_array.remove("cow")
  print(my_array)
#+END_SRC

* Deleting by index

Remember we discussed that an index is a number refering to a position of an item on a list. We can use the "del" command (short for "delete") to remove an item only using the index

#+BEGIN_SRC python
  my_array = [ "pig", "cow", "chicken" ]
  del my_array[1]
  print(my_array)
#+END_SRC

#+RESULTS:
: ['pig', 'chicken']

* 2 Dimensional Arrays

Arrays can hold anything. This includes other arrays. So the following array has different animals seperated by species.

#+BEGIN_SRC python
  animals = [ [ "Mocking", "Blue", "Cardinal" ],
              [ "Polar", "Grizzly", "Black" ],
              [ "Retriever", "Poodle", "Lab" ] ]
  print(animals)
#+END_SRC

#+RESULTS:
: [['Mocking', 'Blue', 'Cardinal'], ['Polar', 'Grizzly', 'Black'], ['Retriever', 'Poodle', 'Lab']]

* Tic Tac Toe

To practice using 2 dimensianal arrays, we will play tic tac toe with a partner. It will not automatically determine a winner but will just keep track of the state of the board.

#+BEGIN_SRC python
  game_board = [ [ " ", " ", " " ], [ " ", " ", " " ], [ " ", " ", " " ] ]
  print(game_board[0])
  print(game_board[1])
  print(game_board[2])
#+END_SRC

#+RESULTS:
: [' ', ' ', ' ']
: [' ', 'X', ' ']
: [' ', ' ', ' ']
